/*
企业发放的奖金根据利润提成。利润I低于或等于100000元的，奖金可提10%；

利润高于100000，低于200000时，低于100000元的部分按10%提成，高于100000元的部分，可提成7.5%；

利润高于200000，低于400000时，低于200000元的部分人按上述方法提成（下同），高于200000元的部分按5%提成；

利润高于400000，低于600000时，高于400000元的部分按3%提成；

利润高于600000，低于1000000时，高于600000的部分按1.5%提成；

利润高于1000000时，超过1000000的部分按1%提成。从键盘输入当月利润I，求应发奖金数（输出奖金保留两位小数）。

输入：156890 输出：14266.75
输入：234000 输出：19200.00
*/
#include <stdio.h>
int main()
{
	 float I;
	 int R;
	 scanf("%f",&I);
	 R=I/100000;
	 switch(R)
	 {
	     case 0:printf("%5.2f",I*0.1);
	     		break;
	     case 1:printf("%5.2f",(I-100000)*0.075+10000);
	     		break;
	     case 2:
	     case 3:printf("%5.2f",10000+7500+(I-200000)*0.05);
	     		break;
	     case 4:
	     case 5:printf("%5.2f",10000+7500+10000+(I-400000)*0.03);
	     		break;
	     case 6:
	     case 7:
	     case 8:
	     case 9:printf("%5.2f",10000+7500+10000+6000+(I-600000)*0.015);
	     		break;
	     default:printf("%5.2f",10000+7500+10000+6000+6000+(I-1000000)*0.01);
	     		break;
	 }
	 return 0;
}