//求圆、球和圆柱的周长、表面积及体积

/*
设圆半径r=1.5，圆柱高h=3，求圆周长、圆面积、圆球表面积、圆球体积、圆柱体积。编程序，用scanf输入数据，输出计算结果。输出时要有文字说明，取小数点后面两位数。 

输入: 

1.5,3

输出:

圆周长为：l= 9.42
圆面积为：s= 7.07
圆球的表面积为：sq= 28.27
圆球体积为：vq= 14.14
圆柱体积为：vz= 21.21


*/
#include<stdio.h> 
int main() 
{     
	float r,h,l,s,sq,vq,vz,pi=3.14159;     
	scanf("%f,%f",&r,&h);     
	l=2*pi*r;     
	s=pi*r*r;     
	sq=4*pi*r*r;     
	vq=(4.0/3)*pi*r*r*r;    
	vz=s*h;     
	printf("圆周长为:l=%.2f\n圆面积为:s=%.2f\n圆球的表面积为:sq=%.2f\n圆球体积为:vq=%.2f\n圆柱体积为:vz=%.2f\n",l,s,sq,vq,vz);
	return 0; 
}